#include"stdio.h"
//7.c
int main(){
//<<   <<=
//左移运算，高位舍弃，低位补0（有可能改变符号位）
//n 左移 m位== n * 2的m次方
//3
//0000 0000 0000 0000 0000 0000 0000 0011
//16+8=24=3*2^3
//0000 0000 0000 0000 0000 0000 0001 1000

    int a=3;
    a<<=3;
    printf("a=%d\n",a);

//>>  >>=
//右移运算，低位舍弃，高位正数补0,负数补1
//n 左移 m位== n / 2的m次方
//48
//0000 0000 0000 0000 0000 0000 0011 0000
//3
//0000 0000 0000 0000 0000 0000 0000 0011
    a=48;
    a>>=4;
    printf("a=%d\n",a);
    
    int n=0;
    int bit=32;
//    int i;
    printf("请输入1个整数:\n");
    scanf("%d",&n);

    while(bit--){
	int a=n>>bit&1;
	printf("%d",a);
	if(bit%4==0)
	    printf(" ");
    }
    putchar(10);
    return 0;
}
