[以太网的目的地址(6字节)][以太网源地址(6字节)][帧类型(2字节)]
|<------------------以太网首部----------------------------->|

[硬件类型(2字节)][协议类型(2字节)][硬件地址长度(1字节)][协议地址长度(1字节)][op(2字节)][发送端以太网地址(6字节)][发送端ip地址(6字节)][目的以太网地址(4字节)][目的ip地址(4字节)]
|<----------------------------------------------28字节ARP请求/应答---------------------------------------------------------------->|


当第一次发送的时候
[00:00:00:00:00:00:00][192.168.12.1][0806][...8字节][发送端的mac][00:00:00:00:00:00:00][192.168.1.35]
然后进入网络环境去匹配,找到后,然后开始进行填充
[00:00:00:00:00:00:00][192.168.12.1][0806][...8字节][发送端的mac][发送端ip][接收端mac][接收端ip]
但是要将目的ip和源ip以及目的mac和源mac进行反换,发送回去

然后接收到数据后,要把起初发送时,缺少的目的地址填充上,在带着数据发送过去

所以在网络中传输的过程,每到一个路由,都要解封装和封装的过程(也就是把ip和mac地址拿出来)
