#ifndef _TEACHER_H
#define _TEACHER_H
#include<stdio.h>
#include<stdlib.h>
#include<unistd.h>
#include<string.h>
#include"link.h"

//教师权利函数声明

extern void teacher();
/*****************************************
函数：void teacher();
功能：显示教师界面
参数：无
返回值：无
******************************************/

extern void te_register();
/*****************************************
函数：void te_register();
功能：显示教师注册界面
参数：无
返回值：无
******************************************/

extern void te_link();
/*****************************************
函数：void te_link();
功能：教师注册，读教师文件，创教师链表
参数：无
返回值：无
******************************************/

extern void te_login();
/*****************************************
函数：void te_login();
功能：教师登录
参数：无
返回值：无
******************************************/

extern void te_news(ST1 *te_head);
/*****************************************
函数：void te_news(ST1 *te_head);
功能：教师查看自己信息
参数：教师链表头
返回值：无
******************************************/

extern void te_key_change(ST1 *head,ST1 *te_head);
/*****************************************
函数：void te_key_change(ST1 *head,ST1 *te_head);
功能：教师修改自己密码
参数：1.教师链表头，2.教师链表中自己的地址头
返回值：无
******************************************/

extern void display_all_student();
/*****************************************
函数：void display_all_student();
功能：显示所有学生信息
参数：无
返回值：无
******************************************/

extern void record_mark(ST1 *te_head);
/*****************************************
函数：void record_mark();
功能：教师给学生录入成绩
参数：某教师地址
返回值：无
******************************************/

extern void record_other(ST1 *te_head);
/*****************************************
函数：void record_mark();
功能：教师给学生录其它信息，班级，职务，类别
参数：某教师地址
返回值：无
******************************************/

extern void gpa_rank();
/*****************************************
函数：void gpa_rank();
功能：所有学生成绩排名
参数：无
返回值：无
******************************************/


#endif
