#include<stdio.h>

//与运算：与0相与是0，与1相与是本身
//取反运算：
//异或运算：相同为0，不同为1
//任何数跟本身异或是0
//任何数跟正数0异或是本身
//异或没有顺序

//<< 左移运算
//高位舍弃，地位补0，可能改变符号位
//n左移4位，等价于 n * 2的4次方
//
//>> 右移运算
//低位舍弃，高位，正数补0，负数补1

int main(){
    //-5
    //1000 0000 0000 0000 0000 0000 0000 0101
    //反码
    //1111 1111 1111 1111 1111 1111 1111 1010
    //+1
    //1111 1111 1111 1111 1111 1111 1111 1011
    //补码
    //0000 0000 0000 0000 0000 0000 0000 0100
    //4
    int num = -5;
    printf("%d\n", ~num);

    //4
    //0000 0000 0000 0000 0000 0000 0000 0100
    //反码
    //0111 1111 1111 1111 1111 1111 1111 1011
    //-1
    //0111 1111 1111 1111 1111 1111 1111 1010
    //补码 
    //1000 0000 0000 0000 0000 0000 0000 0101
    //-5
    num = 4;
    printf("%d\n", ~num);

    int count = 0;
    num = 88888;
    while(num){
        num &=num - 1;
        count ++;
    }
    printf("%d\n", count);//9

    num = 88888;
    int bit = 32, n = 0;
    while(bit--){
        int a = num>>bit&1;
        printf("%d", a);
        if(!(bit % 4))
            putchar(' ');
    }
    putchar(10);
    //0000 0000 0000 0001 0101 1011 0011 1000
    num = -10;
    num <<= 31;
    printf("%d\n", num);//0

    return 0;
}
