#ifndef _MANAGE_H
#define _MANAGE_H

//管理员权利函数声明

extern void menu();
/*****************************************
函数：void menu();
功能：显示学生管理系统主界面
参数：无
返回值：无
******************************************/

extern void admin_change();
/*****************************************
函数：void admin_change();
功能：管理员修改自己信息
参数：无
返回值：无
******************************************/

extern void display_all_teacher();
/*****************************************
函数：void display_all_teacher();
功能：显示所有教师信息
参数：无
返回值：无
******************************************/

extern void del_student();
/*****************************************
函数：void del_student();
功能：管理员注销学生
参数：无
返回值：无
******************************************/

extern void del_teacher();
/*****************************************
函数：void del_teacher();
功能：管理员注销教师
参数：无
返回值：无
******************************************/

extern void ma_login();
/*****************************************
函数：void ma_login();
功能：管理员登录
参数：无
返回值：无
******************************************/

extern void manager();
/*****************************************
函数：void manager();
功能：显示管理员界面
参数：无
返回值：无
******************************************/

extern void my_system();
/*****************************************
函数：void my_system();
功能：学生系统进入
参数：无
返回值：无
******************************************/


#endif
