//------------------------------------------------------------------
// 版权声明：本程序模块属于金证券商综合业务系统(KBSS)的一部分
//           金证科技股份有限公司  版权所有
//
// 文件名称：xsdk_file.h
// 模块名称：文件操作类
// 模块描述：本模块提供对文件操作的统一接口
//           编译时候加-D_FILE_OFFSET_BITS=64宏，程序中把使用fseek,ftell的地方分别换成fseeko,ftello
//
// 开发作者：钟兆斌
// 创建日期：2012-02-21
// 模块版本：1.0.000.000
//-------------------------------------------------------------------
// 修改日期      版本              作者            备注
//-------------------------------------------------------------------
// 2012-02-21  1.0.000.000        钟兆斌          原创
//-------------------------------------------------------------------

#if !defined(__xsdk_file_h__)
#define __xsdk_file_h__

#include <stdio.h>
#include <time.h>
#include <iostream>
#include <string>
#include "xsdk_define.h"

BGN_NAMESPACE_XSDK

#ifdef __cplusplus
extern "C"
{
#endif

//#define OS_IS_WINDOWS

#ifndef _MAX_PATH
#define _MAX_PATH 256
#endif

#ifdef OS_IS_WINDOWS
//#define snprintf _snprintf
#define access _access
#else
#define _FILE_OFFSET_BITS 64
#define __int64 long long
#endif

#define MODE_READ "rt"
#define MODE_WRITE "wt"
#define MODE_APPEND "at"
#define MODE_READ_WRITE "rt+"
#define MODE_CREATE "wt+"

typedef void * HANDLE;
typedef unsigned char BYTE;

struct ST_FILE_STATUS
{
  struct tm *pstCTime;                //文件创建时间
  struct tm *pstMTime;                //文件最后修改时间
  struct tm *pstATime;                //最后访问时间
  __int64 llSize;                    //文件大小(byte)
  BYTE bAttribute;                   //文件属性
  char szFullName[_MAX_PATH];        //文件完整路径+文件名
};

//--------------------------------------------------------------------
//   类名称：CFile
// 简要描述：该类提供对文件的基础操作接口，创建、删除、复制、文件
//           内容读取、文件写入等
//--------------------------------------------------------------------
class CFile
{
  protected:
    bool m_bCloseOnDelete;      //是否在关闭文件时删除CFile对象
    std::string m_strFileName;  //文件名
  
  public:
    enum OpenFlags 
    {  
      modeRead = 0x0000,       //只读模式打开
      modeWrite = 0x0001,       //只写模式打开
      modeReadWrite = 0x0002,       //读写模式打开,写入时，需要将文件指针指向末尾
      //shareCompat = 0x0000,       //
      //shareExclusive = 0x0010,       //独占读写模式打开
      //shareDenyWrite = 0x0020,       //独占写模式打开，不允许其他进程、线程同时写模式打开  
      //shareDenyRead = 0x0030,       //独占读模式打开，不允许其他进程、线程同时读模式打开
      //shareDenyNone = 0x0040,       //共享模式打开
      //modeNoInherit = 0x0080,       //防继承模式打开
      modeCreate = 0x1000,       //创建新文件，若文件存在，则截断文件长度为0
      modeNoTruncate = 0x2000,       //结合modeCreate一同使用，当打开一个已存在文件时，不截断文件长度为0
      //typeText = 0x4000, // typeText and typeBinary are used in  
      //typeBinary = (int)0x8000 // derived classes only  
    };  
    /*
    enum Attribute 
    {
      normal = 0x00,      //正常文件
      readOnly = 0x01,      //只读文件
      hidden = 0x02,      //隐藏文件
      system = 0x04,      //系统文件
      volume = 0x08,      //
      directory = 0x10,      //目录
      archive = 0x20       //档案文件
    };  
    */
    enum SeekPosition 
    { 
      begin = 0x0,           //头
      current = 0x1,         //当前
      end = 0x2              //尾
    };  

    //enum { pFileNull = NULL }; //空文件句柄

    FILE *m_pFile;          //文件句柄

    CFile();

    CFile(FILE *p_pFile);

    CFile(const char *p_pszFileName, unsigned int p_iOpenFlags);

    ~CFile();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Open
    // 简要描述：打开指定文件
    //
    // 其他说明：
    // 入参说明：[in]  string  p_pszFileName    无   文件完整路径
    //           [in]  uint    p_iOpenFlags     无   打开模式
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    int Open(const char *p_pszFileName, unsigned int p_iOpenFlags);
    
    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Close
    // 简要描述：关闭文件
    //
    // 其他说明：
    // 入参说明：
    // 返回结果： 
    //--------------------------------------------------------------------------------
    void Close();
    
    //??
    void Abort();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Read
    // 简要描述：读取文件内容
    //
    // 其他说明：
    // 入参说明：[out]  string  p_pszBuf   无   文件内容字符数据
    //           [in]   int     p_iCount   无   取文件字符串数据最大长度
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    int Read(char *p_pszBuf, int p_iCount);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Write
    // 简要描述：写入文件
    //
    // 其他说明：
    // 入参说明：[in]   string  p_pszBuf   无   需要写入文件的字符数据
    //           [in]   int     p_iCount   无   取文件字符串数据最大长度
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    int Write(const char *p_pszBuf, int p_iCount);
    ///MFC返回值为void

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Flush
    // 简要描述：刷新缓冲区
    //
    // 其他说明：
    // 入参说明：
    // 返回结果： 
    //--------------------------------------------------------------------------------
    void Flush();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::Seek
    // 简要描述：移动文件指针
    //
    // 其他说明：
    // 入参说明：[in]   __int64  p_llOff   无   需要移动的偏移量
    //           [in]   int      p_iFrom   无   指针移动开始位置
    // 返回结果：__int  移动后文件指针偏移量  
    //--------------------------------------------------------------------------------
    __int64 Seek(__int64 p_llOff, int p_iFrom);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::SeektoBegin
    // 简要描述：设置文件指针到文件开始位置
    //
    // 其他说明：
    // 入参说明：
    // 返回结果： 
    //--------------------------------------------------------------------------------
    void SeektoBegin();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::SeektoEnd
    // 简要描述：设置文件指针到文件逻辑结束位置
    //
    // 其他说明：
    // 入参说明：
    // 返回结果：__int  结束位置的文件指针偏移量
    //--------------------------------------------------------------------------------
    __int64 SeektoEnd();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetLength
    // 简要描述：获取文件内容数据长度
    //
    // 其他说明：
    // 入参说明：
    // 返回结果：__int  文件内容数据长度
    //--------------------------------------------------------------------------------
    __int64 GetLength();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::SetLength
    // 简要描述：设置文件长度
    //
    // 其他说明：需要在写的打开模式下使用
    // 入参说明：[in]   __int64  p_llNewLine   无   设置的长度值
    // 返回结果：
    //--------------------------------------------------------------------------------
    int SetLength(__int64 p_llNewLine);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::LockRange
    // 简要描述：文件内容加锁
    //
    // 其他说明：
    // 入参说明：[in]   __int64  p_llPos    无   锁定文件起始位置
    //           [in]   __int64  p_llCount  无   锁定数据长度
    // 返回结果：
    //--------------------------------------------------------------------------------
    void LockRange(__int64 p_llPos, __int64 p_llCount);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::UnlockRange
    // 简要描述：文件内容解锁
    //
    // 其他说明：
    // 入参说明：[in]   __int64  p_llPos    无   解锁文件起始位置
    //           [in]   __int64  p_llCount  无   解锁数据长度
    // 返回结果：
    //--------------------------------------------------------------------------------
    void UnlockRange(__int64 p_llPos, __int64 p_llCount);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetPosition
    // 简要描述：获取文件指针位置
    //
    // 其他说明：
    // 入参说明：
    // 返回结果：__int  文件指针位置
    //--------------------------------------------------------------------------------
    __int64 GetPosition();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetStatus
    // 简要描述：获取文件状态
    //
    // 其他说明：
    // 入参说明：[out]  struct  p_stStatus  无  文件状态
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    int GetStatus(xsdk::ST_FILE_STATUS &p_stStatus);

    /// 文件状态 结构体？？？？
    
    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetStatus
    // 简要描述：获取文件状态
    //
    // 其他说明：静态方法
    // 入参说明：[out]  struct  p_stStatus      无  文件状态
    //           [in]   int     p_pszFileName  无  文件路径
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    static int GetStatus(xsdk::ST_FILE_STATUS &p_stStatus, const char *p_pszFileName);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetFileName
    // 简要描述：获取文件名
    //
    // 其他说明：
    // 入参说明：
    // 返回结果：string  文件名
    //--------------------------------------------------------------------------------
    std::string GetFileName();

    //GetFileTitle();
    
    //--------------------------------------------------------------------------------
    // 函数名称：CFile::GetFilePath
    // 简要描述：获取文件路径
    //
    // 其他说明：
    // 入参说明：
    // 返回结果：string  文件路径
    //--------------------------------------------------------------------------------
    std::string GetFilePath();

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::UnlockRange
    // 简要描述：设置文件路径
    //
    // 其他说明：
    // 入参说明：[in]   string  p_pszNewName  无  新设置的文件路径
    // 返回结果：
    //--------------------------------------------------------------------------------
    void SetFilePath(const char *p_pszNewName);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::SetStatus
    // 简要描述：设置文件状态
    //
    // 其他说明：静态方法
    // 入参说明：[out]  struct  p_stStatus     无  文件状态
    //           [in]   int     p_pszFileName  无  文件路径
    // 返回结果： int  调用结果
    //                  0   成功
    //                  非0 具体错误代码
    //--------------------------------------------------------------------------------
    static void SetStatus(xsdk::ST_FILE_STATUS p_stStatus, const char *p_pszFileName);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::UnlockRange
    // 简要描述：重命名文件
    //
    // 其他说明：
    // 入参说明：[in]   string  p_pszOldName  无  旧的文件名
    //           [in]   string  p_pszNewName  无  新的文件名
    // 返回结果：
    //--------------------------------------------------------------------------------
    static int Rename(const char *p_pszOldName, const char *p_pszNewName);

    //--------------------------------------------------------------------------------
    // 函数名称：CFile::UnlockRange
    // 简要描述：删除文件
    //
    // 其他说明：
    // 入参说明：[in]   string  p_pszFileName  无  文件路径
    // 返回结果：
    //--------------------------------------------------------------------------------
    static int Remove(const char *p_pszFileName);
    
    //--------------------------------------------------------------------------------
    // 函数名称：CFile::FileExists
    // 简要描述：判断文件是否存在
    //
    // 其他说明：
    // 入参说明：[in]  string  p_pszFilePath    无   文件完整路径
    // 返回结果： int  调用结果
    //                  0   存在
    //                  -1  不存在
    //--------------------------------------------------------------------------------
    int FileExists(const char *p_pszFilePath);
    
    //--------------------------------------------------------------------------------
    // 函数名称：CFile::CopyFile
    // 简要描述：复制文件
    //
    // 其他说明：
    // 入参说明：[in]  string  p_pszDestPath  无   拷贝目的文件路径
    //           [in]  string  p_pszSourPath  无   拷贝源文件路径
    // 返回结果： int  调用结果
    //                  0    调用成功
    //                  非0  错误代码
    //--------------------------------------------------------------------------------
    static int CopyFiles(const char *p_pszDestPath, const char *p_pszSourPath);

};

#ifdef __cplusplus
}
#endif       //__cplusplus

END_NAMESPACE_XSDK

#endif       //__xsdk_file_h__
