#ifndef _STUDENT_H
#define _STUDENT_H
#include<stdio.h>
#include<stdlib.h>
#include<unistd.h>
#include<string.h>
#include"link.h"


//学生权利函数声明

extern void student();
/*****************************************
函数：void student();
功能：显示学生界面
参数：无
返回值：无
******************************************/

extern void st_register();
/*****************************************
函数：void st_register();
功能：显示学生注册界面
参数：无
返回值：无
******************************************/

extern void st_link();
/*****************************************
函数：void st_link();
功能：学生注册
参数：无
返回值：无
******************************************/

extern void st_login();
/*****************************************
函数：void st_login();
功能：学生登录
参数：无
返回值：无
******************************************/

extern void st_news(ST *st_head);
/*****************************************
函数：void st_news(ST *st_head);
功能：学生查看自己信息
参数：学生链表中自己的地址
返回值：无
******************************************/

extern void st_key_change(ST *head,ST *st_head);
/*****************************************
函数：void st_key_change(ST *head,ST *st_head);
功能：学生修改密码
参数：1：学生链表头，2：学生链表中自己的地址
返回值：无
******************************************/

#endif
